Revit 2027 API
Railing.IsDefault Property
 Indicates if the railing is the default one that system generates.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsDefault { get; }
Public ReadOnly Property IsDefault As Boolean
	Get
public:
property bool IsDefault {
	bool get ();
}
member IsDefault : bool with get
Property Value
Boolean
See Also
Reference
Railing Class
Autodesk.Revit.DB.Architecture Namespace